In [2]:
#hierarchical Indexing
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(8),index=[['a','a','a','b','b','c','c','d'],[1,2,3,4,2,5,1,2]])
data

a  1    0.319391
   2   -0.381631
   3   -1.296513
b  4    0.060756
   2   -2.725925
c  5   -0.553756
   1    0.644704
d  2   -0.352162
dtype: float64

In [3]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3, 4, 5]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3], [0, 1, 2, 3, 1, 4, 0, 1]])

In [18]:
data.sort_index()

a  1    0.319391
   2   -0.381631
   3   -1.296513
b  2   -2.725925
   4    0.060756
c  1    0.644704
   5   -0.553756
d  2   -0.352162
dtype: float64

In [4]:
data['b']

4    0.060756
2   -2.725925
dtype: float64

In [7]:
data.loc[['b','c']]

b  4    0.060756
   2   -2.725925
c  5   -0.553756
   1    0.644704
dtype: float64

In [8]:
data['b':'d']

b  4    0.060756
   2   -2.725925
c  5   -0.553756
   1    0.644704
d  2   -0.352162
dtype: float64

In [9]:
data.loc[:,2]

a   -0.381631
b   -2.725925
d   -0.352162
dtype: float64

In [10]:
data.unstack()

          1         2         3         4         5
a  0.319391 -0.381631 -1.296513       NaN       NaN
b       NaN -2.725925       NaN  0.060756       NaN
c  0.644704       NaN       NaN       NaN -0.553756
d       NaN -0.352162       NaN       NaN       NaN

In [11]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
     columns=[['Ohio', 'Ohio', 'Colorado'],
     ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [12]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [13]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           codes=[[1, 1, 0], [0, 1, 0]])

In [14]:
frame.index.names = ['key1','key2']

In [15]:
frame.columns.names=['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [17]:
frame.sort_index()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [19]:
frame.swaplevel('key1','key2').sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [20]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [21]:
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [22]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [23]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [24]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
     'c': ['one', 'one', 'one', 'two', 'two',
     'two', 'two'],
     'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [27]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [28]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [29]:
frame.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

In [ ]:
#Combining and merging datasets

In [30]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
     'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
     'data2': range(3)})

In [38]:
pd.merge(df1,df2,on='key',how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [39]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
     'key2': ['one', 'two', 'one'],
     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
     'key2': ['one', 'one', 'one', 'two'],
     'rval': [4, 5, 6, 7]})

In [41]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [48]:
pd.merge(left,right,how='outer',on=['key1'],suffixes=['_left','_right'])

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [49]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
     'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [50]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [51]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
     'Nevada', 'Nevada'],
     'key2': [2000, 2001, 2002, 2001, 2002],
     'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
     index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
     'Ohio', 'Ohio'],
     [2001, 2000, 2000, 2000, 2001, 2002]],
     columns=['event1', 'event2'])

In [53]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [54]:
pd.merge(lefth,righth,how='outer',right_index=True,left_on=['key1','key2'])

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [55]:
s1 = pd.Series([1,2],index=['a','b'])
s2 = pd.Series([3,4,5],index=['c','d','e'])
s3 = pd.Series([6,7],index=['f','g'])

In [59]:
pd.concat([s1,s2,s3])

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [72]:
pd.concat([s1,s2,s3],keys=['one','two','three'])

one    a    1
       b    2
two    c    3
       d    4
       e    5
three  f    6
       g    7
dtype: int64

In [64]:
s4 = pd.concat([s1,s3])
s4

a    1
b    2
f    6
g    7
dtype: int64

In [66]:
pd.concat([s1,s4],axis=1,join='outer')

C:\Users\deadpool\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  1.0  1
b  2.0  2
f  NaN  6
g  NaN  7

In [73]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [76]:
pd.concat([df1,df2],ignore_index=True)

C:\Users\deadpool\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  1.546840  0.022241 -1.557621 -0.704462
1 -0.603405  0.877186  0.121667  0.860779
2  0.305852 -0.319944  0.284674 -0.085835
3 -0.969485  0.028160       NaN -0.810320
4  0.779092 -1.843401       NaN  0.479920

In [77]:
#Reshaping and Pivoting
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [81]:
data2 = pd.concat([s1,s2],keys=['one','two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [84]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [83]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64